{
  "Фреймворк": "Заранее разработанный набор инструментов и конвенций для создания программных приложений. Обеспечивает структурированный подход к разработке и поддержке приложений.",
  "Паттерн проектирования": "Общее решение для типичных проблем в проектировании программных систем. Обеспечивает повторное использование успешных архитектурных решений.",
  "MVC (Model-View-Controller)": "Шаблон проектирования, который разделяет приложение на три основных компонента: Модель (Model), Представление (View) и Контроллер (Controller). Модель отвечает за данные и бизнес-логику, Представление отвечает за отображение данных пользователю, а Контроллер управляет взаимодействием между ними.",
  "MVVM (Model-View-ViewModel)": "Шаблон проектирования, который расширяет концепцию MVC, добавляя промежуточное звено, называемое ViewModel. В MVVM Модель представляет данные и бизнес-логику, Представление отвечает за отображение данных, а ViewModel служит связующим звеном между ними, обеспечивая отделение бизнес-логики от пользовательского интерфейса.",
  "First Contentful Paint": "Метрика, показывающая время до показа пользователю запрошенного контента (тела статьи и т.п.).",
  "Largest Contentful Paint": "Метрика, измеряющая скорость загрузки самого большого элемента на веб-странице, например, изображения или блока текста.",
  "Total Blocking Time": "Метрика, показывающая время, в течение которого происходит блокировка страницы в ответ на действия пользователя: клики мышью или нажатия клавиш.",
  "Time to Interactive": "Метрика, показывающая время до момента, когда страница становится интерактивной (начинают работать события и т.д.).",
  "Chrome DevTools": "Набор инструментов, встроенных в браузер Google Chrome, для создания и отладки сайтов.",
  "WebPage Test": "Бесплатный инструмент для измерения производительности веб-страниц, поддерживающий кроссбраузерное тестирование.",
  "PageSpeed Insight": "Комплексный инструмент для определения фактической производительности и выбора эффективных путей оптимизации сайта.",
  "SPA": "Веб-приложение или веб-сайт, использующий единственный HTML-документ как оболочку для всех веб-страниц и организующий взаимодействие с пользователем через динамически подгружаемые HTML, CSS, JavaScript.",
  "Angular": "Фреймворк от компании Google для создания продвинутых бесшовных (одностраничных) веб-приложений — SPA (Single Page Applications) — на языках программирования TypeScript, JavaScript.",
  "Vue": "Прогрессивный JavaScript-фреймворк, используемый для построения пользовательских интерфейсов. Vue предоставляет гибкие инструменты для создания пользовательских интерфейсов с минимальной затратой усилий. Его основные принципы - простота и легкость использования.",
  "Производительность сайта": "Характеристика, оценивающая, насколько быстро веб-страница загружается и реагирует на действия пользователя.",
  "WebVitals": "Набор метрик, измеряющих пользовательский опыт на веб-страницах, с акцентом на такие аспекты, как время загрузки страницы, интерактивность и стабильность отображения."
}
